app/Controllers/Dashboard.php

SELECT *
FROM `fitxers`
WHERE `codiU` = 'Marc'
---
    public function index()
    {
        $session = session();
        if ($session->logged_in == false) {
            $session->set('msg', 'No te has logueado');
            return redirect()->to('/');
        }
        else {
            $model = new FitxerModel();
            $compartir = new CompartirFitxer();
            $data = $model->where('codiU', $session->codiU)
            ->findAll();

INSERT INTO `compartir` (`codiF`, `codiUC`) VALUES ('2', 'Marc')
---
    public function compartir()
    {
        $session = session();

        $dades = [
            'codiF'    => $this->request->getVar('compartirF'),
			'codiUC'     => $this->request->getVar('compartirU'),
		];

        $model = new CompartirFitxer();
        $model->insert($dades);